BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/AT90USB82.PIC
        <edc:AdjustPoint edc:_addr="0x83" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x84" edc:access="nnnnnnnnnnnnnnnn" edc:cname="TCNT1" edc:nzwidth="0x10" ltx:memberofperipheral="TC1"/>
        <edc:SFRDef edc:_addr="0x86" edc:access="nnnnnnnnnnnnnnnn" edc:cname="ICR1" edc:nzwidth="0x10" ltx:memberofperipheral="TC1"/>
        <edc:SFRDef edc:_addr="0x88" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR1A" edc:nzwidth="0x10" ltx:memberofperipheral="TC1"/>
        <edc:SFRDef edc:_addr="0x8A" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR1B" edc:nzwidth="0x10" ltx:memberofperipheral="TC1"/>
        <edc:SFRDef edc:_addr="0x8C" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR1C" edc:nzwidth="0x10" ltx:memberofperipheral="TC1"/>
        <edc:AdjustPoint edc:_addr="0x8E" edc:offset="0x3A"/>
        <edc:SFRDef edc:_addr="0xC8" edc:access="nnnnnnnn" edc:cname="UCSR1A" edc:nzwidth="0x8" ltx:memberofperipheral="USART1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MPCM1" edc:desc="Multi-processor Communication Mode" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2X1" edc:desc="Double the USART transmission speed" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UPE1" edc:desc="Parity Error" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DOR1" edc:desc="Data overRun" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FE1" edc:desc="Framing Error" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UDRE1" edc:desc="USART Data Register Empty" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXC1" edc:desc="USART Transmitt Complete" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXC1" edc:desc="USART Receive Complete" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xC9" edc:access="nnnnnnnn" edc:cname="UCSR1B" edc:nzwidth="0x8" ltx:memberofperipheral="USART1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB81" edc:desc="Transmit Data Bit 8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB81" edc:desc="Receive Data Bit 8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UCSZ12" edc:desc="Character Size" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXEN1" edc:desc="Transmitter Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXEN1" edc:desc="Receiver Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UDRIE1" edc:desc="USART Data register Empty Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXCIE1" edc:desc="TX Complete Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXCIE1" edc:desc="RX Complete Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xCA" edc:access="nnnnnnnn" edc:cname="UCSR1C" edc:nzwidth="0x8" ltx:memberofperipheral="USART1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UCPOL1" edc:desc="Clock Polarity" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UCSZ1" edc:desc="Character Size" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="USBS1" edc:desc="Stop Bit Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UPM1" edc:desc="Parity Mode Bits" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="UMSEL1" edc:desc="USART Mode Select" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xCB" edc:access="------nn" edc:cname="UCSR1D" edc:nzwidth="0x8" ltx:memberofperipheral="USART1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RTSEN" edc:desc="RTS Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CTSEN" edc:desc="CTS Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xCC" edc:access="nnnnnnnnnnnnnnnn" edc:cname="UBRR1" edc:nzwidth="0x10" ltx:memberofperipheral="USART1"/>
        <edc:SFRDef edc:_addr="0xCE" edc:access="nnnnnnnn" edc:cname="UDR1" edc:nzwidth="0x8" ltx:memberofperipheral="USART1"/>
        <edc:AdjustPoint edc:_addr="0xCF" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xD0" edc:access="nnnnnn-n" edc:cname="CLKSEL0" edc:nzwidth="0x8" ltx:memberofperipheral="CPU">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLKS" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="EXTE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RCE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EXSUT" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="RCSUT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xD1" edc:access="nnnnnnnn" edc:cname="CLKSEL1" edc:nzwidth="0x8" ltx:memberofperipheral="CPU">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EXCKSEL" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="RCCKSEL" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xD2" edc:access="------nn" edc:cname="CLKSTA" edc:nzwidth="0x8" ltx:memberofperipheral="CPU">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EXTON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RCON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xD3" edc:offset="0x5"/>
        <edc:SFRDef edc:_addr="0xD8" edc:access="n-n-----" edc:cname="USBCON" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="FRZCLK" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="USBE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xD9" edc:offset="0x7"/>
        <edc:SFRDef edc:_addr="0xE0" edc:access="-----nnn" edc:cname="UDCON" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DETACH" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RMWKUP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSTCPU" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE1" edc:access="-nnnnn-n" edc:cname="UDINT" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SUSPI" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SOFI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EORSTI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WAKEUPI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EORSMI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UPRSMI" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE2" edc:access="-nnnnn-n" edc:cname="UDIEN" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SUSPE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SOFE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EORSTE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WAKEUPE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EORSME" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UPRSME" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE3" edc:access="nnnnnnnn" edc:cname="UDADDR" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UADD" edc:nzwidth="0x7"/>
              <edc:SFRFieldDef edc:cname="ADDEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE4" edc:access="nnnnnnnnnnnnnnnn" edc:cname="UDFNUM" edc:nzwidth="0x10" ltx:memberofperipheral="USB_DEVICE"/>
        <edc:SFRDef edc:_addr="0xE6" edc:access="---n----" edc:cname="UDMFN" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="FNCERR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xE7" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xE8" edc:access="nnnnnnnn" edc:cname="UEINTX" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXINI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STALLEDI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOUTI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXSTPI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NAKOUTI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RWAL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NAKINI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIFOCON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE9" edc:access="nnnnnnnn" edc:cname="UENUM" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE"/>
        <edc:SFRDef edc:_addr="0xEA" edc:access="---nnnnn" edc:cname="UERST" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EPRST" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEB" edc:access="--nnn--n" edc:cname="UECONX" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EPEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="RSTDT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STALLRQC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STALLRQ" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEC" edc:access="nn-----n" edc:cname="UECFG0X" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EPDIR" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="EPTYPE" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xED" edc:access="-nnnnnn-" edc:cname="UECFG1X" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ALLOC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPBK" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="EPSIZE" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEE" edc:access="nnn-nnnn" edc:cname="UESTA0X" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NBUSYBK" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="DTSEQ" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="UNDERFI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OVERFI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CFGOK" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEF" edc:access="-----nnn" edc:cname="UESTA1X" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CURRBK" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="CTRLDIR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF0" edc:access="nn-nnnnn" edc:cname="UEIENX" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXINE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STALLEDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOUTE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXSTPE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NAKOUTE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="NAKINE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLERRE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF1" edc:access="nnnnnnnn" edc:cname="UEDATX" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE"/>
        <edc:SFRDef edc:_addr="0xF2" edc:access="nnnnnnnn" edc:cname="UEBCLX" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE"/>
        <edc:AdjustPoint edc:_addr="0xF3" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xF4" edc:access="nnnnnnnn" edc:cname="UEINT" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE"/>
        <edc:AdjustPoint edc:_addr="0xF5" edc:offset="0x5"/>
        <edc:SFRDef edc:_addr="0xFA" edc:access="-------n" edc:cname="PS2CON" edc:nzwidth="0x8" ltx:memberofperipheral="PS2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PS2EN" edc:desc="Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xFB" edc:access="nnnnnnnn" edc:cname="UPOE" edc:nzwidth="0x8" ltx:memberofperipheral="PS2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DMI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DPI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DATAI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCKI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UPDRV" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="UPWE" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
